package com.company.kanel_fraiman.section_11;

public class task_11_15 {
    /*
    Напишите класс, который выводит на экран в строку все положительные
    двузначные четные числа (в возрастающем порядке). Числа должны
    отделяться друг от друга знаком «пробел». Перед началом и после
    окончания вывода серии чисел на экран вывода следует вывести текстовые
    сообщения (по выбору).
     */
    public static void main(String[] args) {
        int i;
            System.out.println("Отображение целых двухзначных чисел: ");
        for (i = 10; i <= 99; i++) {
                System.out.print(i + " ");
        }
            System.out.println("\nВсе числа отображены.");
    }
}
