package com.company.kanel_fraiman.section_2;

public class task_2_3 {
    /*
    Напишите класс,
    который выводит на экран
    в первой строке три знака «+»,
    во второй - четыре знака«!»,
    в третьей - два знака«?».
     */
    public static void main(String[] args) {
        String s1 = "+++";
        String s2 = "!!!!";
        String s3 = "??";
        System.out.println(s1);
        System.out.println(s2);
        System.out.println(s3);
    }
}
