package com.company.kanel_fraiman.section_2;

public class task_2_4 {
    /*
    Напишите класс,
    который выводит на экран тем же количеством команд знаки,
    которые выводились в задании № 3,
    но все знаки должны выводиться в одной строке.
     */
    public static void main(String[] args) {
        String s1 = "+++";
        String s2 = "!!!!";
        String s3 = "??";
        System.out.print(s1);
        System.out.print(s2);
        System.out.print(s3);
    }
}
