package com.company.kanel_fraiman.section_2;

import java.util.Scanner;

public class task_2_5 {
    /*
Дан класс:
import java.util.*;
class targil2 {
    static Scanner reader = new Scanner(System.in);

    public static void main(String[] args) {
        // Scanner reader = new Scanner(System.in);

        int a = reader.nextInt();
        System.out.println("aa=" + (a*a));
        System.out.println("al0=" + (a*10));
    }
}
1. Укажите, какая информация будет выводиться на экран, если с
клавиатуры введено значение 6? Объясните ответ.
2. Укажите, какая информация будет выводиться на экран, если с
клавиатуры введено значение -6? Объясните ответ.
3. Предложите изменения в программе, чтобы ввод и вывод выглядели
более «дружественно».
     */
    static Scanner reader = new Scanner(System.in);

    public static void main(String[] args) {
        // Scanner reader = new Scanner(System.in);

        int a = reader.nextInt();
        System.out.println("aa=" + (a*a));
        System.out.println("al0=" + (a*10));
    }
}
