package com.company.kanel_fraiman.section_10;

public class task_10_21 {
    /*
    Положение точки в прямоугольной (декартовой) системе координат
определяется двумя числам: координатами Х и У.
Напишите класс, который генерирует и выводит на экран два случайных
целых числа из диапазона от-30 до +30.
Класс должен определить (и вывести на экран соответствующую информацию):
• в какой четверти расположена точка;
• к какой из осей она ближе;
расстояние между началом координат и точкой;
• округленное до целого (но - не больше истинного!) расстояние из
предыдущего пункта;
• угол (в градусах), который образует линия, соединяющая точку с
началом координат, с осью Х.
     */
}
