package com.company.kanel_fraiman.section_10;

public class task_10_8 {
    /*
    Напишите класс, который принимает с клавиатуры целое число и затем
    генерирует («придумывает>>) случайное число из следующего диапазона:
    • «центром диапазона» является введенное с клавиатуры число;
    • количество чисел в диапазоне равно 11.
    Класс должен определять, «угадал» ли компьютер введенное число и
    выводить на экран одно из сообщений (в зависимости от соотношения
    введенного и «придуманного» чисел):
    • угадал - если числа совпали;
    • слишком большое - если «придуманное» компьютером число
    больше введенного с клавиатуры;
    • слишком маленькое - если «придуманное» компьютером число
    меньше введенного с клавиатуры.
     */
}
