package com.company.kanel_fraiman.section_10;

public class task_10_22 {
    /*
    Отрезок в прямоугольной (декартовой) системе координат задается
двумя парами чисел: xl, yl определяют положение (координаты) начала
отрезка (точка А), а х2, у2 определяют положение (координаты)
конца отрезка (точка В).
Напишите класс, который генерирует и выводит на экран две пары
случайных целых числа из диапазона от -30 до +30: первая пара - координаты
точки А, вторая - координаты точки В.
Класс должен определить (и вывести на экран соответствующую информацию):
• длину отрезка;
• округленную длину отрезка (но не больше истинного!);
• угол (в градусах), который образует отрезок с осью Х;
• какую ось пересекает отрезок, и пересекает ли он какую-либо ось
вообще.
     */
}
