package com.company.kanel_fraiman.section_1;

/*
Перед вами словесные описания объявления и инициализации переменных.
Запишите их в правилах языка Java - в разных допустимых вариантах.
 */

public class task_1_3 {
    public static void main(String[] args) {
        /*
        Переменная e (типа "простое целое") получает значение 16
        */
            int e = 16;
        /*
        Переменные х и t относятся к типу «простое целое», при этом значение переменной х равно -2
        */
            int x = -2, t;
        /*
        Переменные z и f относятся к «вещественному типу»,
        при этом переменная z имеет значение 5.5,
        а значение переменной f в 10 раз больше значения переменной t
        */
            double z = 5.5, f = 10 * z;
    }
}
