package com.company.kanel_fraiman.section_1;

public class task_1_7 {
    /*
    Напишите фрагмент класса,
    который присваивает переменной х целочисленное значение,
    а затем присваивает переменной у треть от значения переменной х.
     */
    public static void main(String[] args) {
        int x = 0;
        double y = (double) x / 3;
        System.out.println(y);
    }
}
